<a href="https://colab.research.google.com/github/KT-engbyte/Hamoye_Hello-World/blob/master/Copy_of_Stage_1_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Load and Read Fuel_Ferc csv file**
*:Check head of dataframe and cleanup data before processing*

In [8]:
import pandas as pd
data = pd.read_csv('https://raw.githubusercontent.com/WalePhenomenon/climate_change/master/fuel_ferc1.csv')
data.head()

                record_id  ...  fuel_cost_per_mmbtu
0   f1_fuel_1994_12_1_0_7  ...                1.121
1  f1_fuel_1994_12_1_0_10  ...                1.120
2   f1_fuel_1994_12_2_0_1  ...                1.650
3   f1_fuel_1994_12_2_0_7  ...                1.970
4  f1_fuel_1994_12_2_0_10  ...                2.570

[5 rows x 11 columns]

In [9]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29523 entries, 0 to 29522
Data columns (total 11 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   record_id                     29523 non-null  object
 1   utility_id_ferc1              29523 non-null  int64
 2   report_year                   29523 non-null  int64
 3   plant_name_ferc1              29523 non-null  object
 4   fuel_type_code_pudl           29523 non-null  object
 5   fuel_unit                     29343 non-null  object
 6   fuel_qty_burned               29523 non-null  float64
 7   fuel_mmbtu_per_unit           29523 non-null  float64
 8   fuel_cost_per_unit_burned     29523 non-null  float64
 9   fuel_cost_per_unit_delivered  29523 non-null  float64
 10  fuel_cost_per_mmbtu           29523 non-null  float64
dtypes: float64(5), int64(2), object(4)
memory usage: 2.5+ MB

*** ***

***Observe negative fuel cost per unit burned & negative fuel cost per mmbtu. Data cleaning required before visualization and interpretation***

In [30]:
data["fuel_cost_per_unit_burned"].max(), data["fuel_cost_per_unit_burned"].min()

(139358.0, -276.08)

In [24]:
data["fuel_qty_burned"].max(), data["fuel_qty_burned"].min()

(555894250.0, 1.0)

In [26]:
data["fuel_cost_per_mmbtu"].max(), data["fuel_cost_per_mmbtu"].min()

(359278.0, -41.501000000000005)